"""
Напишите декоратор печатающий время выполнения данной функции.
"""


# Декоратор пишем тут


def func_to_decor():
    for i in range(1000):
        print(i)
