"""
Создайте словарь, в котором ключами будут числа от 1 до 10, а значениями эти же числа, возведенные в куб.
"""
print("jktuh")
list1 = {1,2,3,4,5,6}
list2 = {4,16,1,3,8,2}
print(list1 | list2)